WEB/app/controllers/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT "buildings".* FROM "buildings"

    def set_building
      @building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?