WEB/app/views/admin/buildings/show.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = ?  [["building_id", 1]]
---
<h3>Místnosti:</h3>
<% @building.rooms.each do |room| %>