WEB/app/views/admin/courses/show.html.erb

	<br>
	<% @course.students.each do |student| %>
---
SELECT "students".* FROM "students" INNER JOIN "student_assignments" ON "students"."id" = "student_assignments"."student_id" WHERE "student_assignments"."course_id" = ?  [["course_id", 1]]