WEB/app/controllers/admin/buildings_controller.rb

  def index
    @buildings = Building.all
---
SELECT "buildings".* FROM "buildings"

  def update
    respond_to do |format|
      if @building.update(building_params)
---
UPDATE "buildings" SET "code" = ?, "updated_at" = ? WHERE "buildings"."id" = ?  [["code", "GAMAF"], ["updated_at", "2018-11-19 19:47:06.758923"], ["id", 7]]

  def destroy
    @building.destroy
---
DELETE FROM "buildings" WHERE "buildings"."id" = ?  [["id", 2]]

    def set_building
      @building = Building.find(params[:id])
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]