WEB/app/controllers/admin/courses_controller.rb

INSERT INTO "courses" ("title", "code", "created_at", "updated_at", "study_type", "language") VALUES (?, ?, ?, ?, ?, ?)  [["title", "AJ4"], ["code", "AJ4"], ["created_at", "2017-12-17 20:10:50.335114"], ["updated_at", "2017-12-17 20:10:50.335114"], ["study_type", 1], ["language", 1]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save