WEB/app/controllers/admin/lessons_controller.rb

  def index
    @lessons = Lesson.all.includes(:course).includes(:teacher)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN (1, 3, 4, 7)
SELECT "lessons".* FROM "lessons"
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" IN (1, 3, 2)

  def create
    @lesson = Lesson.new(lesson_params)

    respond_to do |format|
      if @lesson.save
---
INSERT INTO "lessons" ("start_at", "end_at", "durration", "created_at", "updated_at", "room_id", "teacher_id", "course_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "start_at" = ?, "end_at" = ?, "updated_at" = ? WHERE "lessons"."id" = ?  [["start_at", "2018-11-26 23:00:00"], ["end_at", "2018-11-27 22:59:00"], ["updated_at", "2018-11-26 20:41:11.193914"], ["id", 2]]

  def destroy
    @lesson.destroy
---
DELETE FROM "lessons" WHERE "lessons"."id" = ?  [["id", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]