WEB/app/controllers/admin/rooms_controller.rb

DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 25]]
---
  def destroy
    @room.destroy