WEB/app/controllers/admin/teachers_controller.rb

  def index
    @teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]