WEB/app/views/buildings/overview.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = ?  [["building_id", 1]]
---
            <tbody>
              <% @building.rooms.each do |room| %>

SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                      <td>
                        <%= lesson.teacher.first_name %> <%= lesson.teacher.last_name %>

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "students" INNER JOIN "student_assignments" ON "students"."id" = "student_assignments"."student_id" WHERE "student_assignments"."course_id" = ?  [["course_id", 1]]
---
                      <td>
                        <%= lesson.course.students.count %>