WEB/app/views/buildings/show.html.erb

SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = ?  [["building_id", 1]]
SELECT  1 AS one FROM "rooms" WHERE "rooms"."building_id" = ? LIMIT ?
---
    <div class="col-md-5">
      <% if @building.rooms.empty? %>

SELECT "rooms".* FROM "rooms" WHERE "rooms"."building_id" = ?
---

          <% @building.rooms.each do |room| %>