WEB/app/views/rooms/show.html.erb

            <p><%=   lesson.course.code   %></p>
            <p><%= lesson.teacher.first_name %> <%= lesson.teacher.last_name %></p>
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]